/**
  ******************************************************************************
  * @file  stf_isp_base_reg.h
  * @author  StarFive Isp Team
  * @version  V1.0
  * @date  12/14/2019
  * @brief
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STARFIVE SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2019 Shanghai StarFive</center></h2>
  */
#ifndef __STF_ISP_BASE_REG_H__
#define __STF_ISP_BASE_REG_H__


#include "registers/isp_reg.h"
#include "registers/stf_isp_csi_in_rdma.h"
#include "registers/stf_isp_isp_in_rdma.h"
#include "registers/stf_isp_crop_rdma.h"
#include "registers/stf_isp_sud_csi_rdma.h"
#include "registers/stf_isp_sud_isp_rdma.h"


/* add ISP and CSI base registers structure */
//=============================================================================
#define EN_CSI                  (1LL << 0)  // 0x0000 - REG_ENABLE_STATUS: (1 << 0).
//-----------------------------------------------------------------------------

                                                    //                     This bit will be set by HW when ISP has finished processing and must be cleared by writing 0 to the register.
                                                    //                     Register write can also set the INT bit (for test purposes). HW set has precedence over register write.
    EN_INT_CSI_DONE             = (1LL << 25),      // 0x0A00, [25] VSINT - CSI capture end interrupt bit.
    EN_INT_SC_DONE              = (1LL << 26),      // 0x0A00, [26] VSFWINT - SC dump done interrupt bit. No trigger if SC is disabled.
    EN_INT_LINE_INT             = (1LL << 27),      // 0x0A00, [27] LBERRINT - Line interrupt bit.
    EN_INT_ISP_CSI_DONE         = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_CSI_DONE
                                  ),
    EN_INT_ISP_SC_DONE          = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_SC_DONE
                                  ),
    EN_INT_ISP_LINE_DNOE        = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_CSI_SC_DONE          = (
                                    EN_INT_CSI_DONE
                                  | EN_INT_SC_DONE
                                  ),
    EN_INT_CSI_LINE_DNOE        = (
                                    EN_INT_CSI_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_SC_LINE_DNOE         = (
                                    EN_INT_SC_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_ISP_CSI_SC_DONE    = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_CSI_DONE
                                  | EN_INT_SC_DONE
                                  ),
    EN_INT_ISP_CSI_LINE_DONE    = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_CSI_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_ISP_SC_LINE_DONE     = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_SC_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_CSI_SC_LINE_DONE     = (
                                    EN_INT_CSI_DONE
                                  | EN_INT_SC_DONE
                                  | EN_INT_LINE_INT
                                  ),
    EN_INT_ALL                  = (
                                    EN_INT_ISP_DONE
                                  | EN_INT_CSI_DONE
                                  | EN_INT_SC_DONE
                                  | EN_INT_LINE_INT
                                  ),
} EN_ISP_INTERRUPT, *PEN_ISP_INTERRUPT;


#pragma pack(push, 1)
typedef struct _ST_TEMP_INFO {
    STF_U16 u16MeasureTemperature;              /** AWB measure temperature degree. */
    STF_U8 u8TemperatureIdx;                    /** Indicate CCM temperature table index, this index will plus 100 if measure temperature out of temperature table. */
    STF_DOUBLE dTemperatureFactor;              /** Temperature factor. */
} ST_TEMP_INFO, *PST_TEMP_INFO;

typedef struct _ST_ISP_BASE_ENABLE {
    STF_U8 u8IspIdx;
    STF_BOOL8 bEnable;
} ST_ISP_BASE_ENABLE, *PST_ISP_BASE_ENABLE;

typedef struct _ST_ISP_BASE_RESET {
    STF_U8 u8IspIdx;
    STF_BOOL8 bReset;
} ST_ISP_BASE_RESET, *PST_ISP_BASE_RESET;

typedef struct _ST_ISP_BASE_BOOL8_STATUS {
    STF_U8 u8IspIdx;
    STF_BOOL8 bStatus;
} ST_ISP_BASE_BOOL8_STATUS, *PST_ISP_BASE_BOOL8_STATUS;

typedef struct _ST_ISP_BASE_U32_STATUS {
    STF_U8 u8IspIdx;
    STF_U32 u32Status;
} ST_ISP_BASE_U32_STATUS, *PST_ISP_BASE_U32_STATUS;

typedef struct _ST_ISP_BASE_INTERRUPT {
    STF_U8 u8IspIdx;
    EN_ISP_INTERRUPT enInterrupt;
} ST_ISP_BASE_INTERRUPT, *PST_ISP_BASE_INTERRUPT;

typedef struct _ST_ISP_BASE_COUNT {
    STF_U8 u8IspIdx;
    STF_U16 u16Count;
} ST_ISP_BASE_COUNT, *PST_ISP_BASE_COUNT;

typedef struct _ST_MODULE_EN_PARAM {
    STF_U64 u64Module;
    STF_BOOL8 bEnable;
} ST_MODULE_EN_PARAM, *PST_MODULE_EN_PARAM;

typedef struct _ST_ISP_MODULE_EN_PARAM {
    STF_U8 u8IspIdx;
    ST_MODULE_EN_PARAM stModulesEnableParam;
} ST_ISP_MODULE_EN_PARAM, *PST_ISP_MODULE_EN_PARAM;

typedef struct _ST_MODULES_EN_PARAM {
    STF_U64 u64Modules;
    STF_BOOL8 bEnable;
} ST_MODULES_EN_PARAM, *PST_MODULES_EN_PARAM;

typedef struct _ST_ISP_MODULES_EN_PARAM {
    STF_U8 u8IspIdx;
    ST_MODULES_EN_PARAM stModulesEnableParam;
} ST_ISP_MODULES_EN_PARAM, *PST_ISP_MODULES_EN_PARAM;

typedef struct _ST_SENSOR_PARAM {
    EN_IMAGER_SEL enImagerSel;
    EN_DVP_ITU656 enItu656;
    EN_DVP_SYNC_POLARITY enPolarity;
} ST_SENSOR_PARAM, *PST_SENSOR_PARAM;

typedef struct _ST_ISP_SENSOR_PARAM {
    STF_U8 u8IspIdx;
    ST_SENSOR_PARAM stSensorParam;
} ST_ISP_SENSOR_PARAM, *PST_ISP_SENSOR_PARAM;

typedef struct _ST_SENSOR_RAW_FORMAT {
    STF_U8 u8IspIdx;
    EN_CFA_RAW_FMT enRawFormat;
} ST_SENSOR_RAW_FORMAT, *PST_SENSOR_RAW_FORMAT;

typedef struct _ST_ISP_CSI_BASE_PARAM {
    ST_SENSOR_PARAM stSensorParam;
    EN_CFA_RAW_FMT enRawFormat;
    ST_RECT stRect;
    EN_ISP_1ST_PXL enFirstPixel;
    EN_ISP_MULTI_FRAME_MODE enMultiFrameMode;
} ST_ISP_CSI_BASE_PARAM, *PST_ISP_CSI_BASE_PARAM;

typedef struct _ST_ISP_CSI_BASE_PARAMETERS {
    STF_U8 u8IspIdx;
    ST_ISP_CSI_BASE_PARAM stIspCsiBaseParam;
} ST_ISP_CSI_BASE_PARAMETERS, *PST_ISP_CSI_BASE_PARAMETERS;

//#if defined(SUPPORT_VIC_2_0)
typedef struct _ST_HW_VER {
    union {
        STF_U32 u32Version;
        struct {
            STF_U8 SubVer   : 4;
            STF_U8 Ver      : 4;
            STF_U8 ID[3];
        };
    };
} ST_HW_VER, *PST_HW_VER;

typedef struct _ST_HW_VERSION {
    STF_CHAR szName[4];
    STF_U8 u8Version;
    STF_U8 u8SubVersion;
} ST_HW_VERSION, *PST_HW_VERSION;

typedef struct _ST_ISP_HW_VERSION {
    STF_U8 u8IspIdx;
    ST_HW_VERSION stHwVersion;
} ST_ISP_HW_VERSION, *PST_ISP_HW_VERSION;

//#endif //#if defined(SUPPORT_VIC_2_0)
#if 0
typedef struct _ST_CSI_CAP_WIN {
    REG_CAPTURE_WINDOW_START TopLeft;               // 0x001C, input picture capture start cfg(x/y start location), each 16bit (cropping).
    REG_CAPTURE_WINDOW_END BottomRight;             // 0x0020, input picture capture end cfg(x/y end location), each 16bit (cropping).
} ST_CSI_CAP_WIN, *PST_CSI_CAP_WIN;

typedef struct _ST_ISP_CTRL {
    REG_ISPCTRL0 Ctrl0;                             // 0x0A00, ISP Control Register 0.
    REG_ISPCTRL1 Ctrl1;                             // 0x0A08, ISP Control Register 1.
} ST_ISP_CTRL, *PST_ISP_CTRL;

typedef struct _ST_ISP_BASE_REG {
    REG_FUNCTION_MODE CsiModule;                    // 0x0010, csi module enable register.
    REG_SENSOR  Sensor;                             // 0x0014, input dvp format & signal polarity cfg.
    REG_CFA CfaRawFormat;                           // 0x0018, input RAW format cfg.
    ST_CSI_CAP_WIN stCsiCapWin;                     // 0x001C - 0x0020, input picture capture region cfg(x/y start and end location), each 16bit (cropping).
    ST_ISP_CTRL stIspCtrl;                          // 0x0A00 and 0x0A08, ISP Control Register.
    REG_IFSZ IspCapSize;                            // 0x0A0C, isp pipeline X/Y size, each 13bits(after decimation).
} ST_ISP_BASE_REG, *PST_ISP_BASE_REG;
#elif 1
typedef struct _ST_ISP_BASE_REG {
    REG_FUNCTION_MODE CsiModule;                    // 0x0010, csi module enable register.
    REG_SENSOR  Sensor;                             // 0x0014, input dvp format & signal polarity cfg.
    REG_CFA CfaRawFormat;                           // 0x0018, input RAW format cfg.
    REG_CAPTURE_WINDOW_START CsiCapWinStart;        // 0x001C, input picture capture start cfg(x/y start location), each 16bit (cropping).
    REG_CAPTURE_WINDOW_END CsiCapWinEnd;            // 0x0020, input picture capture end cfg(x/y end location), each 16bit (cropping).
    REG_ISPCTRL0 IspCtrl0;                          // 0x0A00, ISP Control Register 0.
    REG_ISPCTRL1 IspCtrl1;                          // 0x0A08, ISP Control Register 1.
    REG_IFSZ IspCapSize;                            // 0x0A0C, isp pipeline X/Y size, each 13bits(after decimation).
} ST_ISP_BASE_REG, *PST_ISP_BASE_REG;
#endif

typedef struct _ST_ISP_BASE_REG_PARAM {
    STF_U8 u8IspIdx;
    ST_ISP_BASE_REG stIspBaseReg;
} ST_ISP_BASE_REG_PARAM, *PST_ISP_BASE_REG_PARAM;
#pragma pack(pop)


///* ISP and CSI base registers interface */
////-----------------------------------------------------------------------------
//extern
//STF_VOID STFHAL_ISP_BASE_SetCsiEnable(
//    STF_U8 u8IspIdx,
//    STF_BOOL8 bEnable
//    );
//extern
//STF_BOOL8 STFHAL_ISP_BASE_IsCsiBusy(
//    STF_U8 u8IspIdx
//    );
//extern
//STF_BOOL8 STFHAL_ISP_BASE_IsScdDone(
//    STF_U8 u8IspIdx
//    );
//extern
//STF_BOOL8 STFHAL_ISP_BASE_IsScdError(
//    STF_U8 u8IspIdx
//    );
//extern
//STF_BOOL8 STFHAL_ISP_BASE_IsItu656Field(
//    STF_U8 u8IspIdx
//    );
//extern
//STF_BOOL8 STFHAL_ISP_BASE_IsItu656Error(
//    STF_U8 u8IspIdx
//    );
//extern
